OdGeBoundBlock3d.setToBoxOrtho
\details
Call setToBox(true) if axes is parallel to world coordinate space axes.

OdGeBoundBlock3d.setToBoxOrtho(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Call setToBox(true) if axes is parallel to world coordinate space axes.

OdGeBoundBlock3d.isDisjoint(OdGeBoundBlock3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if specified bounding block
does not intersect this bounding block.
\param block [in]  Any 3D bounding block.

OdGeBoundBlock3d.contains(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this point is
contained in the bounding block.
\param point [in]  Any 3D point.

OdGeBoundBlock3d.#ctor(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
\param lcs [in]  Receives local coordinate system (must be orthogonal)
\param localBox [in]  Receives axis-aligned box in the specified lcs.